tutorials/homogenousTurbulence/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{

    inlet
    {
        type            turbulentATSMInlet;
        periodicInY     true;
        periodicInZ     true;
        vortonType      "typeL";
        density         1;
        value           $internalField;

        U               uniform 1.0;
        R               uniform (0.01 0 0 0.075 0 0.05);
        L               uniform (0.4 0.3 0.2);

/*
        type            turbulentATSMInlet;
        periodicInY     true;
        periodicInZ     true;
        vortonType      "typeL";
        density         1;
        value           $internalField;

        U               uniform 1.0;
        R               uniform (0.01 0 0 0.075 0 0.05);
        L               uniform (0.4 0.3 0.2);

        type            turbulentSEMInlet;
        periodicInY     true;
        periodicInZ     true;
        density         10;
        value           $internalField;

        U               uniform 1.0;
        R               uniform (0.01 0 0 0.075 0 0.05);
        L               uniform (0.4 0.4 0.4 0.3 0.3 0.3 0.2 0.2 0.2);

        type            turbulentDFMInlet;
        periodicInY     true;
        periodicInZ     true;
        filterType      "gaussian";
        filterFactor    4;
        gridFactor      1;
        value           $internalField;

        U               uniform 1.0;
        R               uniform (0.01 0 0 0.075 0 0.05);
        L               uniform (0.4 0.4 0.4 0.3 0.3 0.3 0.2 0.2 0.2);
*/
    }

    outlet
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
