tutorials/homogenousTurbulence/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

L 10;
B 2;
H 1;
H2 2;

vertices
(
    (0 0 0)
    ($L 0 0)
    (0 $H 0)
    ($L $H 0)
    (0 $H2 0)
    ($L $H2 0)

    (0 0 $B)
    ($L 0 $B)
    (0 $H $B)
    ($L $H $B)
    (0 $H2 $B)
    ($L $H2 $B)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (100 20 40) simpleGrading (1 1 1)
    hex (2 3 5 4 8 9 11 10) (100 20 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type            cyclic;
        neighbourPatch  top;
        faces           ((0 1 7 6));
    }

    top
    {
        type            cyclic;
        neighbourPatch  bottom;
        faces           ((4 10 11 5));
    }

    front
    {
        type            cyclic;
        neighbourPatch  back;
        faces           ((0 2 3 1) (2 4 5 3));
    }

    back
    {
        type            cyclic;
        neighbourPatch  front;
        faces           ((6 7 9 8) (8 9 11 10));
    }

    inlet
    {
        type            patch;
        faces           ((0 6 8 2) (2 8 10 4));
    }

    outlet
    {
        type            patch;
        faces           ((1 3 9 7) (3 5 11 9));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
